1. Crear una columna llamada “SurvivalAge” que sea el producto de la
columnas “Survived” y “Age”. Hacerlo por operador y por método.

2. Crear una nueva columna que genere un rango etario para cada
persona, de modo que las edades entre 0 y 9 generen el número 1,
entre 10 y 19 el número 2, etc. de modo que los missing values se
mapeen a cero.

3. Seleccionar los datos de todas las mujeres de primera clase.

4. Seleccionar los datos de los varones menores de edad de
segunda clase.

In [6]:
#1
import pandas as pd
data = pd.read_csv("titanic_testing.csv")
data["SurvivalAge"] = data["Survived"]*data["Age"]
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SurvivalAge
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.0

In [26]:
#2
def func():
    l1=[]
    for x in data["Age"]:
        if x != None:
            l1.append(x%10+1)
        elif pd.isnull(float("Nan")):
            l1.append(0)
    return l1

data["AgeRange"] = func()
data[["AgeRange"]]

     AgeRange
0         3.0
1         9.0
2         7.0
3         6.0
4         6.0
..        ...
886       8.0
887      10.0
888       NaN
889       7.0
890       3.0

[891 rows x 1 columns]

In [25]:
type(data.loc[888, ["Age"]])

pandas.core.series.Series